ycsb_validation_run_t100_r70_u20_i10.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 205159.0
[OVERALL], Throughput(ops/sec), 48742.682504788965
[TOTAL_GCS_PS_Scavenge], Count, 19.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 1405.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.684834689192285
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 19.0
[TOTAL_GC_TIME], Time(ms), 1405.0
[TOTAL_GC_TIME_%], Time(%), 0.684834689192285
[READ-FAILED], Operations, 2.0
[READ-FAILED], AverageLatency(us), 2610.0
[READ-FAILED], MinLatency(us), 318.0
[READ-FAILED], MaxLatency(us), 4903.0
[READ-FAILED], 95thPercentileLatency(us), 4903.0
[READ-FAILED], 99thPercentileLatency(us), 4903.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 72.41
[CLEANUP], MinLatency(us), 1.0
[CLEANUP], MaxLatency(us), 7019.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 25.0
[INSERT], Operations, 1000958.0
[INSERT], AverageLatency(us), 344.1996127709654
[INSERT], MinLatency(us), 20.0
[INSERT], MaxLatency(us), 1.5892479E7
[INSERT], 95thPercentileLatency(us), 110.0
[INSERT], 99thPercentileLatency(us), 775.0
[INSERT], Return=OK, 1000958
[READ], Operations, 7000165.0
[READ], AverageLatency(us), 2730.1629217311306
[READ], MinLatency(us), 58.0
[READ], MaxLatency(us), 1.5974399E7
[READ], 95thPercentileLatency(us), 9223.0
[READ], 99thPercentileLatency(us), 17487.0
[READ], Return=OK, 7000165
[READ], Return=NOT_FOUND, 2
[UPDATE], Operations, 1998875.0
[UPDATE], AverageLatency(us), 310.29020023763366
[UPDATE], MinLatency(us), 10.0
[UPDATE], MaxLatency(us), 1.5876095E7
[UPDATE], 95thPercentileLatency(us), 70.0
[UPDATE], 99thPercentileLatency(us), 540.0
[UPDATE], Return=OK, 1998875