ycsb_validation_run_t100_r95_i5.log
mongo client connection created with mongodb://localhost:27017/ycsb?w=0
[OVERALL], RunTime(ms), 83188.0
[OVERALL], Throughput(ops/sec), 120209.64562196471
[TOTAL_GCS_PS_Scavenge], Count, 92.0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 425.0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.51089099389335
[TOTAL_GCS_PS_MarkSweep], Count, 0.0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0.0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 92.0
[TOTAL_GC_TIME], Time(ms), 425.0
[TOTAL_GC_TIME_%], Time(%), 0.51089099389335
[READ-FAILED], Operations, 2.0
[READ-FAILED], AverageLatency(us), 583.0
[READ-FAILED], MinLatency(us), 359.0
[READ-FAILED], MaxLatency(us), 807.0
[READ-FAILED], 95thPercentileLatency(us), 807.0
[READ-FAILED], 99thPercentileLatency(us), 807.0
[CLEANUP], Operations, 100.0
[CLEANUP], AverageLatency(us), 57.82
[CLEANUP], MinLatency(us), 0.0
[CLEANUP], MaxLatency(us), 5471.0
[CLEANUP], 95thPercentileLatency(us), 3.0
[CLEANUP], 99thPercentileLatency(us), 138.0
[INSERT], Operations, 498790.0
[INSERT], AverageLatency(us), 81.56726077106597
[INSERT], MinLatency(us), 20.0
[INSERT], MaxLatency(us), 102591.0
[INSERT], 95thPercentileLatency(us), 83.0
[INSERT], 99thPercentileLatency(us), 501.0
[INSERT], Return=OK, 498790
[READ], Operations, 9501208.0
[READ], AverageLatency(us), 857.076724559656
[READ], MinLatency(us), 59.0
[READ], MaxLatency(us), 157823.0
[READ], 95thPercentileLatency(us), 2171.0
[READ], 99thPercentileLatency(us), 7843.0
[READ], Return=OK, 9501208
[READ], Return=NOT_FOUND, 2